app/controllers/messages_controller.rb

  def create
    if request.content_type =~ /xml/
      params[:message] = Hash.from_xml(request.body.read)["message"]
      message = Message.create(message: params[:message])
---
INSERT INTO "messages" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2017-11-05 18:19:24.810236"], ["updated_at", "2017-11-05 18:19:24.810236"]]